# GetRegisteredServerIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..GetRegisteredServerIds Method
ExternalService Class See Also
---
Returns Ids of all servers registered for the service.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<Guid> GetRegisteredServerIds()
```

Visual Basic
---
```text
Public Function GetRegisteredServerIds As IList(Of Guid)
```

Visual C++
---
```text
public:
IList<Guid>^ GetRegisteredServerIds()
```

# ### Return Value
An array of Ids of all registered servers. The array may be empty.
# Remarks
The list includes all registered servers regardless of whether they are currently active or not.
# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace